test/containOuterDistance_moveDynamicMesh/modified/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    frontWall
    {
        type            slip;
    }
 backWall
    {
        type            slip;
    }
 bottom
    {
        type            slip;
    }
 symmetryWall
      {
	type symmetryPlane;
      }

    atmosphere
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }

    wec
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }
    inlet
    {
	type 		waveVelocity;
        value           uniform (0 0 0);
    }   

    outlet
    {
	type 		waveVelocity;
        value           uniform (0 0 0);
    }   
}


// ************************************************************************* //
